# GetBoundary Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SiteSubRegion..::..GetBoundary Method
SiteSubRegion Class See Also
---
Gets the boundary of current subregion.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<CurveLoop> GetBoundary()
```

Visual Basic
---
```text
Public Function GetBoundary As IList(Of CurveLoop)
```

Visual C++
---
```text
public:
IList<CurveLoop^>^ GetBoundary()
```

# ### Return Value
The curve loops that represent the boundary.
# See Also
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace